{
  "countries": [
    {
      "name": "Switzerland",
      "description": "Discover Switzerland's timeless beauty, where majestic Alps, crystal-clear lakes, and charming villages await. Embark on epic adventures like hiking the Matterhorn Trail or skiing world-class slopes. Indulge in Swiss hospitality, chocolate, and precision engineering in this picturesque paradise.",
      "hikes": [
        {
          "name": "The Matterhorn Trail",
          "description": "A classic trek offering stunning views of the iconic Matterhorn peak. Traverse alpine meadows, glacial lakes, and rugged terrain from Zermatt to breathtaking vistas."
        },
        {
          "name": "The Eiger Trail",
          "description": "A scenic hike from Grindelwald to Kleine Scheidegg, providing breathtaking views of the Eiger North Face and surrounding peaks amidst lush valleys and cascading waterfalls."
        },
        {
          "name": "The Aletsch Glacier Trail",
          "description": "Experience the longest glacier in the Alps on this trail from Bettmeralp to Riederalp. Enjoy panoramic views of the Aletsch Glacier and surrounding mountains."
        }
      ]
    },
    {
      "name": "New Zealand",
      "description": "Explore New Zealand's stunning landscapes, from the dramatic peaks of the Southern Alps to the pristine beaches of the North Island. Immerse yourself in Maori culture, thrilling outdoor adventures, and breathtaking scenery at every turn.",
      "hikes": [
        {
          "name": "Abel Tasman Coast Track",
          "description": "Wander through golden beaches, native forests, and turquoise waters in Abel Tasman National Park. Encounter stunning coastal vistas and relax in the beauty of nature."
        },
        {
          "name": "Routeburn Track",
          "description": "Crossing between Fiordland and Mt. Aspiring National Parks, this alpine track offers vistas of snow-capped peaks, crystal-clear lakes, and deep valleys amidst stunning landscapes."
        },
        {
          "name": "Mueller Hut Route",
          "description": "A challenging hike near Mount Cook village offering panoramic views of New Zealand's highest peaks, including Aoraki/Mount Cook. Experience alpine terrain and breathtaking vistas."
        }
      ]
    },
    {
      "name": "Canada",
      "description": "Experience the vast wilderness of Canada, where rugged coastlines, towering mountains, and ancient forests beckon adventurers. Discover vibrant cities, diverse cultures, and endless opportunities for outdoor exploration, from kayaking in coastal waters to hiking remote trails.",
      "hikes": [
        {
          "name": "The West Coast Trail",
          "description": "Traverse rugged coastal terrain, old-growth forests, and pristine beaches on Vancouver Island. Encounter wildlife and explore the Pacific coastline on this challenging multi-day hike."
        },
        {
          "name": "The Skyline Trail",
          "description": "Located in Jasper National Park, this scenic trail offers sweeping views of mountains, glaciers, and valleys. Experience the beauty of the Canadian Rockies on this iconic hike."
        },
        {
          "name": "The Fundy Footpath",
          "description": "Stretching along the Bay of Fundy, this challenging hike features rugged cliffs, coastal vistas, and the world's highest tides. Explore remote wilderness and stunning landscapes in New Brunswick."
        }
      ]
    },
    {
      "name": "Norway",
      "description": "Norway invites you to discover its awe-inspiring natural wonders, from majestic fjords to soaring mountains and picturesque villages. Embark on epic hikes like Preikestolen or enjoy scenic drives along winding coastal roads, immersing yourself in Nordic charm and outdoor adventure.",
      "hikes": [
        {
          "name": "Preikestolen (Pulpit Rock) Trail",
          "description": "Overlooking the Lysefjord near Stavanger, this iconic hike takes you to a dramatic cliff ledge with breathtaking views of the fjord below. Experience the beauty of the Norwegian landscape on this unforgettable trek."
        },
        {
          "name": "Romsdalseggen Ridge",
          "description": "Offering panoramic views of the Romsdalen valley and surrounding peaks, this challenging hike near Åndalsnes is considered one of Norway's most scenic trails. Explore alpine terrain and majestic vistas."
        },
        {
          "name": "Besseggen Ridge",
          "description": "Located in Jotunheimen National Park, this exhilarating hike offers stunning views of two glacial lakes and the surrounding peaks. Experience Norway's natural beauty on this iconic ridge trail."
        }
      ]
    },
    {
      "name": "Japan",
      "description": "Welcome to Japan, where ancient traditions blend seamlessly with modern innovation against a backdrop of serene landscapes. Explore historic temples, vibrant cities, and tranquil forests, or embark on unforgettable adventures like hiking the Kumano Kodo or soaking in hot springs.",
      "hikes": [
        {
          "name": "Kumano Kodo",
          "description": "A network of ancient pilgrimage routes in the Kii Mountains, offering hiking options through lush forests, past shrines, and alongside scenic rivers. Immerse yourself in Japanese culture and history on this historic trail."
        },
        {
          "name": "Shirakawa-go and Gokayama",
          "description": "Hike through historic villages in the Japanese Alps, featuring traditional thatched-roof houses and terraced rice fields. Experience the beauty of rural Japan and immerse yourself in local culture."
        },
        {
          "name": "Mount Yoshino",
          "description": "Famous for its cherry blossoms, Mount Yoshino offers scenic hiking trails through forests and along ridges, with stunning views of the surrounding countryside. Experience Japan's natural beauty and cultural heritage on this iconic mountain."
        }
      ]
    },
    {
      "name": "Costa Rica",
      "description": "Uncover the biodiversity and natural beauty of Costa Rica, where lush rainforests, pristine beaches, and active volcanoes await. Immerse yourself in eco-adventures like exploring Corcovado National Park or relaxing in thermal hot springs, all while experiencing \"pura vida\" – the pure life.",
      "hikes": [
        {
          "name": "Corcovado National Park",
          "description": "Explore remote rainforests and pristine beaches in Corcovado National Park, home to diverse wildlife and stunning natural landscapes. Experience Costa Rica's biodiversity and wilderness on this unforgettable hike."
        },
        {
          "name": "Arenal Volcano National Park",
          "description": "Discover the iconic Arenal Volcano and surrounding rainforest on hiking trails in Arenal Volcano National Park. Encounter lush vegetation, wildlife, and volcanic landscapes on this adventure in the Costa Rican wilderness."
        },
        {
          "name": "Rio Celeste",
          "description": "Hike to the stunning blue waters of Rio Celeste waterfall and witness the unique natural phenomenon where two rivers merge to create the distinctive turquoise color. Experience the magic of Costa Rica's natural beauty on this unforgettable trek."
        }
      ]
    }
  ]
}
